# Pandas Walkthrough

In [1]:
# We need to import Pandas & Numpy
import pandas as pd # pd is the alias
import numpy as np #np is the alias

### Basic forms -> Serie & Dataframe

In [2]:
my_serie = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
my_serie

a    0.968640
b   -0.677502
c   -1.236578
d   -2.246368
e    1.570538
dtype: float64

In [3]:
my_dataframe = pd.DataFrame({
    'Name': ['Andres', 'Melissa', 'Freddy'],
    'Lastname': ['Gutierrez', 'Cardenas', 'Vega'],
    'Age': [23, 22, 35],
})
display(my_dataframe)

      Name   Lastname  Age
0   Andres  Gutierrez   23
1  Melissa   Cardenas   22
2   Freddy       Vega   35

In [4]:
my_dataframe['Name']

0     Andres
1    Melissa
2     Freddy
Name: Name, dtype: object

In [5]:
my_dataframe.Name # danger!

0     Andres
1    Melissa
2     Freddy
Name: Name, dtype: object

#### Simple query

In [6]:
my_dataframe[my_dataframe['Name'] == 'Andres']

     Name   Lastname  Age
0  Andres  Gutierrez   23

In [7]:
mask = [True, False, False]

In [8]:
my_dataframe[mask]

     Name   Lastname  Age
0  Andres  Gutierrez   23

### Read external file

In [9]:
pokemon = pd.read_excel('pokemon.xlsx', sheet_name='Pokemon')
pokemon.head()

,#,Name,Type,Total,HP,Attack,Defense,Special Attack,Special Defense,Speed
0,001,Bulbasaur,GRASS,318,45,49,49,65,65,45
1,001,Bulbasaur,POISON,318,45,49,49,65,65,45
2,002,Ivysaur,GRASS,405,60,62,63,80,80,60
3,002,Ivysaur,POISON,405,60,62,63,80,80,60
4,003,Venusaur,GRASS,525,80,82,83,100,100,80

In [10]:
pokemon_moves = pd.read_excel('pokemon.xlsx', sheet_name='Moves')
pokemon_moves.head()

,Name,Type,Cat.,Power,Acc.,PP,TM,Effect,Prob. (%)
0,Absorb,GRASS,Special,20.0,100,25.0,NaN,User recovers half the HP inflicted on opponent.,NaN
1,Acid,POISON,Special,40.0,100,30.0,NaN,May lower opponent's Special Defense.,10.0
2,Acid Armor,POISON,Status,NaN,NaN,40.0,NaN,Sharply raises user's Defense.,NaN
3,Acid Spray,POISON,Special,40.0,100,20.0,NaN,Sharply lowers opponent's Special Defense.,100.0
4,Acrobatics,FLYING,Physical,55.0,100,15.0,TM62,Stronger when the user does not have a held item.,NaN

In [11]:
pokemon_evolution = pd.read_excel('pokemon.xlsx', sheet_name='Evolution')
pokemon_evolution.head()

  Evolving from Evolving to  Level Condition Evolution Type
0     Bulbasaur     Ivysaur   16.0       NaN          Level
1       Ivysaur    Venusaur   32.0       NaN          Level
2    Charmander  Charmeleon   16.0       NaN          Level
3    Charmeleon   Charizard   36.0       NaN          Level
4      Squirtle   Wartortle   16.0       NaN          Level

## Applying merge

In [12]:
merged_pokemon = pokemon.merge(pokemon_evolution, left_on=['Name'], right_on=['Evolving from'])
merged_pokemon.head()

,#,Name,Type,Total,HP,Attack,Defense,Special Attack,Special Defense,Speed,Evolving from,Evolving to,Level,Condition,Evolution Type
0,001,Bulbasaur,GRASS,318,45,49,49,65,65,45,Bulbasaur,Ivysaur,16.0,NaN,Level
1,001,Bulbasaur,POISON,318,45,49,49,65,65,45,Bulbasaur,Ivysaur,16.0,NaN,Level
2,002,Ivysaur,GRASS,405,60,62,63,80,80,60,Ivysaur,Venusaur,32.0,NaN,Level
3,002,Ivysaur,POISON,405,60,62,63,80,80,60,Ivysaur,Venusaur,32.0,NaN,Level
4,004,Charmander,FIRE,309,39,52,43,60,50,65,Charmander,Charmeleon,16.0,NaN,Level

## Get all types by Pokemon

In [13]:
merged_pokemon[merged_pokemon['Name']=='Bulbasaur']['Type']

0     GRASS
1    POISON
Name: Type, dtype: object

In [14]:
merged_pokemon.groupby(by=['Name']).mean();

# BANK ANALYSIS

In [15]:
my_bank = pd.read_excel('transactions.xls')
display(my_bank.head(3))
display(my_bank.tail(3))

         Date Code      Description  Unnamed: 3  Debits  Credits  Balance
0  20/01/2019   CP  GROCERY STORE 1         NaN    1.39      0.0    13.61
1  20/01/2019   CP  GROCERY STORE 1         NaN    3.16      0.0    10.45
2  24/01/2019   CP    LOS PALETEROS         NaN    9.32      0.0     1.13

,Date,Code,Description,Unnamed: 3,Debits,Credits,Balance
430,15/10/2019,TF,TEF A : 934820192,NaN,12.26,0.0,151.10
431,16/10/2019,TF,TEF A : 938555331,NaN,400.00,0.0,500.07
432,16/10/2019,MD,DTR:CLUB_SUELDO-_ANDRES_GUTIER,NaN,375.00,0.0,125.07

In [16]:
#my_bank.columns.tolist()
my_bank = my_bank.drop(['Unnamed: 3'], axis=1)
#my_bank.drop(['Unnamed: 3'], axis=1, inplace=True)

In [17]:
my_bank.head()

         Date Code                  Description  Debits  Credits  Balance
0  20/01/2019   CP              GROCERY STORE 1    1.39     0.00    13.61
1  20/01/2019   CP              GROCERY STORE 1    3.16     0.00    10.45
2  24/01/2019   CP                LOS PALETEROS    9.32     0.00     1.13
3  24/01/2019   MC  TFT DE Gutierrez_Arcia_Andr    0.00    50.00    51.13
4  31/01/2019   3O                    INTERESES    0.00     0.08    51.21

In [18]:
my_bank.shape

(433, 6)

In [19]:
my_bank['Description'].value_counts()#.sort_index(ascending=True)

UBER   *TRIP             800-5          53
UBER TRIP HELP.UBER.COM      .          50
AM PM LA AURORA HEREDIA                 14
RETIRO ATM 353714          HER          14
GROCERY STORE 1                         13
SODA BUENISIMO                          13
PRF DEBITO NORMAL 474581221635          11
RETIRO ATM 397225          HER          10
INTERESES                                9
WALMART TIBAS          DIRECTO           8
EXTREME TECH                             8
MAS X MENOS TIBAS      DIRECTO           8
TEF A : 924924525                        6
CLINICA ASEMBIS HEREDIA                  6
TEF DE: 941148827                        6
TEF A : 938555331                        6
UBR* PENDING.UBER.COM    800-5           5
RETIRO ATM 397225          SJO           5
SUPER VIQUEZ             SANTA           5
UBER   *EATS             800-5           5
WALMART  HEREDIA DIRECTO                 4
INVERSIONES BETANIA JMC                  4
RED LOGISTIC INTERNATIONAALAJU           4
CINEPOLIS LINCOLN                        4
TFT-SINPE A: 814000-11**-****-638975     3
PLATZI BASIC (MONTHLY)   HTTPS           3
UBER EATS HELP.UBER.COM      .           3
MAS X MENOS HEREDIA    DIRECTO           3
FISCHEL TIBAS S05                        3
COMISION TFT-SINPE A: 81400011           3
                                        ..
TIOS COFFE BAR                           1
FARMACIA SERFA           HERED           1
POPS HEREDIA                             1
Spotify P0AF12C98E       S               1
TEF DE:MILTON CARDENAS NAJERA            1
THE CREW                                 1
AMZN Mktp US*MA0MB3MF1   A   .           1
TACO BELL PARQUE DE DIVERSIONE           1
LA TORTILLERIA HEREDIA                   1
TEF DE:ISABEL GUTIERREZ ARCIA            1
UBER   *TRIP X3YO6       800-5           1
UBER   *TRIP LSWFB       800-5           1
ESENCIA MERCADITO                        1
WALMART CIUDAD QUESADA DIRECTO           1
Spotify P0A79A17C7       S               1
COOPEMONTECILLOS                         1
ANTOJITOS MEXICANOS MARIA BONI           1
UBER   *TRIP 2NWRV       800-5           1
UBER   *TRIP VBISP       800-5           1
AMZN Mktp US*MO1IR7690   A   .           1
ESTACION DE SERVICIOS COOAlaju           1
UBER   *TRIP TK3TX       800-5           1
RECREO VERDE                             1
CALZADO XINIA                            1
TEF A : 934820192                        1
OLIVA PIZZERIA CORONADO                  1
AMZN Mktp US*143Y40AB3   A   .           1
FARMACIA SUCRE HEREDIA                   1
FARMACIA SANTA LUCIA LOS ANGEL           1
SUBWAY PLAZA REAL ALAJUELA               1
Name: Description, Length: 157, dtype: int64

In [20]:
my_bank['Date']= pd.to_datetime(my_bank['Date'])

# How much I spend in Uber?

In [21]:
uber = my_bank[my_bank['Description'].str.contains(pat = 'UBER', regex = True)]
uber.head()

         Date Code                     Description  Debits  Credits  Balance
8  2019-03-02   CP  UBER TRIP BWEE5 HELP.UBER    .    2.98      0.0    32.41
19 2019-10-02   CP  UBER   *TRIP HKWQH       800-5    4.63      0.0   652.21
20 2019-10-02   CP  UBER   *TRIP LSWFB       800-5    4.82      0.0   647.39
23 2019-02-13   CP  UBER   *TRIP J6BNH       800-5    3.22      0.0   623.37
27 2019-02-18   CP  UBER   *TRIP TZT3Y       800-5    5.38      0.0   555.87

## Sum of total spent

In [22]:
uber['Debits'].sum()

627.59

## Times Uber asked

In [23]:
uber.shape[0]

125

## Data types

In [24]:
uber.dtypes

Date           datetime64[ns]
Code                   object
Description            object
Debits                float64
Credits               float64
Balance               float64
dtype: object

In [25]:
uber.sort_values(by=['Date'],ascending=True);

## Get the start date and end date

In [26]:
uber.min();
start = uber['Date'].min()
end = uber['Date'].max()
display(start)
display(end)

Timestamp('2019-01-07 00:00:00')

Timestamp('2019-12-10 00:00:00')

In [27]:
end - start

Timedelta('337 days 00:00:00')

## What was the date for max?

In [28]:
uber['Debits'].idxmax()

269

In [29]:
uber.loc[269].Date.day_name()

'Monday'

In [30]:
uber[uber['Date'] == uber.loc[269].Date]

          Date Code                     Description  Debits  Credits  Balance
268 2019-04-08   CP  UBER TRIP HELP.UBER.COM      .    8.56      0.0   165.34
269 2019-04-08   CP  UBER   *EATS             800-5   29.65      0.0   135.69
270 2019-04-08   CP  UBER   *TRIP             800-5    2.92      0.0   132.77

## Number of Uber rides by day

In [31]:
uber.apply(lambda row: row['Date'].day_name() , axis=1).value_counts()

Sunday       27
Saturday     21
Monday       20
Wednesday    17
Tuesday      14
Thursday     14
Friday       12
dtype: int64

# Other External files

In [42]:
hidro = pd.read_excel("SVBTESD.xlsx")
hidro = hidro[:200]

In [43]:
hidro.head()

,Id,SVBTESD_ESAS_TEMP_PIDM,SVBTESD_TERM_CODE,SVBTESD_CRN,SVBTESD_FACULTY_PIDM,SVBTESD_TSSC_CODE,SVBTESD_QCOD_CODE,SVBTESD_SDEF_SEQ_NUM,SVBTESD_SDEF_WEIGHT,SVBTESD_SDEF_TOTAL_SCORE,...,SVBTESD_ACOD_CODE,SVBTESD_PVAC_SEQ_NUM,SVBTESD_PVAC_QPOINTS,SVBTESD_OPEN_ANSWER,SVBTESD_ACTIVITY_DATE,SVBTESD_SURROGATE_ID,SVBTESD_VERSION,SVBTESD_USER_ID,SVBTESD_DATA_ORIGIN,SVBTESD_VPDI_CODE
0,1,1640989,201895,90001,35904,EDD_3RCI,AVE01,5,0.0,0,...,ESCASINO,1,NaN,NaN,2019-01-09 19:48:10,NaN,NaN,NaN,NaN,NaN
1,2,1640989,201895,90001,35904,EDD_3RCI,AVE02,6,0.0,0,...,SIEM_NUN,1,5.0,NaN,2019-01-09 19:48:10,NaN,NaN,NaN,NaN,NaN
2,3,1640989,201895,90001,35904,EDD_3RCI,AVE03,7,0.0,0,...,SIEM_NUN,2,4.0,NaN,2019-01-09 19:48:10,NaN,NaN,NaN,NaN,NaN
3,4,1640989,201895,90001,35904,EDD_3RCI,AVE04,8,0.0,0,...,SIEM_NUN,3,3.0,NaN,2019-01-09 19:48:10,NaN,NaN,NaN,NaN,NaN
4,5,1640989,201895,90001,35904,EDD_3RCI,AVE05,9,0.0,0,...,SIEM_NUN,1,5.0,NaN,2019-01-09 19:48:10,NaN,NaN,NaN,NaN,NaN

In [47]:
transpose = hidro.pivot(index='SVBTESD_ESAS_TEMP_PIDM', columns='SVBTESD_QCOD_CODE', values='SVBTESD_PVAC_QPOINTS')
transpose.head()

SVBTESD_QCOD_CODE,AVE01,AVE02,AVE03,AVE04,AVE05,AVE06,AVE08,EGL09,EGL10,EGL11,...,GN_IN,IED03,INF01,INF04,INF05,JUSTF,TCI35,TCI36,TCI37,TCI38
SVBTESD_ESAS_TEMP_PIDM,,,,,,,,,,,,,,,,,,,,,
1640989,NaN,5.0,4.0,3.0,5.0,5.0,4.0,NaN,NaN,5.0,...,1.0,NaN,NaN,NaN,NaN,NaN,5.0,5.0,5.0,5.0
1640990,NaN,4.0,5.0,5.0,5.0,5.0,5.0,NaN,NaN,5.0,...,1.0,NaN,NaN,NaN,NaN,NaN,5.0,5.0,5.0,5.0
1640991,NaN,5.0,5.0,5.0,5.0,5.0,5.0,NaN,NaN,5.0,...,1.0,NaN,NaN,NaN,NaN,NaN,5.0,5.0,5.0,5.0
1640993,NaN,5.0,5.0,5.0,5.0,5.0,3.0,NaN,NaN,5.0,...,1.0,NaN,NaN,NaN,NaN,NaN,3.0,5.0,3.0,5.0
1640996,NaN,5.0,5.0,4.0,5.0,5.0,5.0,NaN,NaN,5.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [48]:
transpose.to_excel("output.xlsx")